Test Data/Vultr/web-perf-pri3.txt
This is ApacheBench, Version 2.3 <$Revision: 1807734 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 10.1.96.4 (be patient)


Server Software:        Apache/2.4.29
Server Hostname:        10.1.96.4
Server Port:            80

Document Path:          /helloworld.html
Document Length:        115 bytes

Concurrency Level:      100
Time taken for tests:   2.340 seconds
Complete requests:      10000
Failed requests:        0
Keep-Alive requests:    9908
Total transferred:      4206043 bytes
HTML transferred:       1150000 bytes
Requests per second:    4273.07 [#/sec] (mean)
Time per request:       23.402 [ms] (mean)
Time per request:       0.234 [ms] (mean, across all concurrent requests)
Transfer rate:          1755.15 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   0.3      0       3
Processing:     0   14  33.4     13    1299
Waiting:        0   14  33.4     13    1299
Total:          0   15  33.5     13    1302

Percentage of the requests served within a certain time (ms)
  50%     13
  66%     14
  75%     15
  80%     16
  90%     18
  95%     20
  98%     23
  99%     26
 100%   1302 (longest request)