Test Data/Vultr/web-perf-pub1.txt
This is ApacheBench, Version 2.3 <$Revision: 1807734 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 108.61.144.228 (be patient)


Server Software:        Apache/2.4.29
Server Hostname:        108.61.144.228
Server Port:            80

Document Path:          /helloworld.html
Document Length:        115 bytes

Concurrency Level:      100
Time taken for tests:   4.262 seconds
Complete requests:      10000
Failed requests:        0
Keep-Alive requests:    9926
Total transferred:      4206838 bytes
HTML transferred:       1150000 bytes
Requests per second:    2346.58 [#/sec] (mean)
Time per request:       42.615 [ms] (mean)
Time per request:       0.426 [ms] (mean, across all concurrent requests)
Transfer rate:          964.03 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   0.2      0       3
Processing:     0   18 133.8     10    3207
Waiting:        0   18 133.8     10    3207
Total:          0   18 133.8     10    3207

Percentage of the requests served within a certain time (ms)
  50%     10
  66%     10
  75%     11
  80%     11
  90%     13
  95%     14
  98%     19
  99%     38
 100%   3207 (longest request)