Test Data/Vultr/web-perf-pub2.txt
This is ApacheBench, Version 2.3 <$Revision: 1807734 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 108.61.144.228 (be patient)


Server Software:        Apache/2.4.29
Server Hostname:        108.61.144.228
Server Port:            80

Document Path:          /helloworld.html
Document Length:        115 bytes

Concurrency Level:      100
Time taken for tests:   1.327 seconds
Complete requests:      10000
Failed requests:        0
Keep-Alive requests:    9947
Total transferred:      4207432 bytes
HTML transferred:       1150000 bytes
Requests per second:    7535.20 [#/sec] (mean)
Time per request:       13.271 [ms] (mean)
Time per request:       0.133 [ms] (mean, across all concurrent requests)
Transfer rate:          3096.08 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   0.2      0       4
Processing:     0   13   4.8     13     335
Waiting:        0   13   4.8     13     335
Total:          0   13   4.8     13     335

Percentage of the requests served within a certain time (ms)
  50%     13
  66%     14
  75%     15
  80%     15
  90%     17
  95%     19
  98%     21
  99%     23
 100%    335 (longest request)