Test Data/Vultr/web-perf-pub3.txt
This is ApacheBench, Version 2.3 <$Revision: 1807734 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 108.61.144.228 (be patient)


Server Software:        Apache/2.4.29
Server Hostname:        108.61.144.228
Server Port:            80

Document Path:          /helloworld.html
Document Length:        115 bytes

Concurrency Level:      100
Time taken for tests:   1.340 seconds
Complete requests:      10000
Failed requests:        0
Keep-Alive requests:    9930
Total transferred:      4206797 bytes
HTML transferred:       1150000 bytes
Requests per second:    7462.71 [#/sec] (mean)
Time per request:       13.400 [ms] (mean)
Time per request:       0.134 [ms] (mean, across all concurrent requests)
Transfer rate:          3065.83 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   0.2      0       3
Processing:     1   13  13.9     12    1252
Waiting:        1   13  13.9     12    1252
Total:          1   13  13.9     12    1254

Percentage of the requests served within a certain time (ms)
  50%     12
  66%     13
  75%     14
  80%     15
  90%     17
  95%     18
  98%     21
  99%     23
 100%   1254 (longest request)